joachimth/track-robot/firmware/sdkconfig.defaults
# Track Robot Firmware - Default SDK Configuration

# Target chip
CONFIG_IDF_TARGET="esp32c5"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Flash size (ESP32-C5 has 16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM (ESP32-C5 has 8MB PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_40M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHDOG_TIMEOUT_S=5

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Wi-Fi Configuration
# Users should customize these via `idf.py menuconfig` or in config.h
# CONFIG_WIFI_SSID="TrackRobot"
# CONFIG_WIFI_PASSWORD="12345678"

# ESP HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# UART
CONFIG_UART_ISR_IN_IRAM=y

# GPIO
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=y

# Enable stack overflow checking
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Bluetooth (for future PS4 controller implementation)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y

# Component config - JSON
CONFIG_JSON_ENABLE_CUSTOM_ALLOCATOR=n

# Performance
CONFIG_ESP_TIMER_TASK_PRIORITY=22
